Revit 2026 API

# WaterChillerType Enumeration

---

The type of water chiller.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WaterChillerType
```
```vb
Public Enumeration WaterChillerType
```
```cpp
public enum class WaterChillerType
```
```fsharp
type WaterChillerType
```

| Member name | Value | Description |
| --- | --- | --- |
| AirCooled | 0 |  |
| WaterCooled | 1 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace